app/controllers/causas_controller.rb

SELECT "causas".* FROM "causas" WHERE "causas"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    id = params[:id]
    @causa=Causa.find(id)

SELECT "causas".* FROM "causas" ORDER BY avvocato_chiamante asc
---
  def index
    session[:sort_by]=nil unless session.has_key?(:sort_by)
    session[:sort_by]=params[:sort_by] if params.has_key?(:sort_by)
    @causas=Causa.all

INSERT INTO "causas" ("avvocato_chiamante", "avvocato_chiamato", "chiamante", "chiamato", "codice_causa", "data", "giudice", "luogo") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @causa=Causa.new(causa_params)
    @causa.save!#=Causa.create!(params[:causa])

SELECT "causas".* FROM "causas" WHERE "causas"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @causa = Causa.find params[:id]

SELECT "causas".* FROM "causas" WHERE "causas"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "causas" SET "data" = ? WHERE "causas"."id" = 3  [["data", Wed, 25 Sep 2013 09:01:00 UTC +00:00]]
---
  def update
    @causa = Causa.find params[:id]
    @causa.update_attributes!(causa_params)

SELECT "causas".* FROM "causas" WHERE "causas"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "causas" WHERE "causas"."id" = ?  [["id", 5]]
---
  def destroy
    @causa = Causa.find(params[:id])
    @causa.destroy